Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G28A.tmx
Source language: en_us
Languages: zh_cn

source: Zora Neale Hurston, 1891-1960: A Storyteller About African-American Life in the South
zh_cn: 美国黑人女作家卓拉赫斯特小传

source: Zora Neale Hurston was born in eighteen ninety-one in Notasulga, Alabama. A short time later, her family moved to Eatonville, a small town in central Florida.
zh_cn: 卓拉尼尔赫斯特于1891年出生在阿拉巴马州的诺塔苏加，出生后不久，她家就搬到了佛罗里达州中部的一个小镇----

source: All of the people of Eatonville were African-American.
zh_cn: 伊顿威尔，在这个小镇居住的全都是非裔。

source: The town shaped Hurston's life and her writing.
zh_cn: 这个小镇塑造了赫斯特的生活和她的写作。

source: As a child, she would listen closely to the stories told by the adults in the town.
zh_cn: 作为一个小孩，她听镇里年长者讲故事。

source: Several of her books take place in communities very similar to Eatonville. The people she wrote about in her books are very similar to people she knew there.
zh_cn: 她后来所写的几部书的故事都发生在与伊顿威尔镇非常相似的社会环境，她笔下的人物与她所了解的人物都非常相似。

source: Zora was born at a time of racial tensions between blacks and whites in the southern United States. But she never felt angry about being black.
zh_cn: 卓拉出生在美国南部，而且正处于黑人与白人之间种族矛盾非常尖锐的时期，但她从来就没有因为自己是一个黑人感觉到难过。

source: In her stories, she described Eatonville as a place where black Americans could live as they pleased.
zh_cn: 在她的短篇小说中，她把伊顿威尔镇描述成一个美国黑人能够按他们自己意愿生活的地方。

source: Zora Neale Hurston was known for her ability to tell a story.
zh_cn: 卓拉尼尔赫斯特以其善讲故事而闻名。

source: Storytelling is an important part of many cultural traditions.
zh_cn: 讲故事是许多传统文化的一个重要组成部分。

source: African-American storytelling is a strong family tradition that dates back hundreds of years.
zh_cn: 讲故事是非裔一个古老的家庭传统，其具体时间可要追溯到几百年前。

source: It is a way for people to establish their identities in often unfriendly areas as they struggle to hold their communities together.
zh_cn: 当人们生活在一些陌生的社会环境中，讲故事就是人们相互确认身份，建立一个团结社会的方式。

source: Zora Neale Hurston was the fifth of eight children.
zh_cn: 卓拉 尼尔 赫斯特兄弟姐妹八个，她排行老五。

source: Zora's mother was a schoolteacher. Her father was a builder and a church preacher. He also became the mayor of Eatonville.
zh_cn: 卓拉的母亲是一位老师，她父亲是一位建筑工人和教堂里的牧师，他还是伊顿威尔镇的镇长。

source: Zora's mother died in nineteen-oh-four, when Zora was thirteen years old.
zh_cn: 卓拉的母亲于1904年去逝，那时她还只有十三岁。

source: Her mother's death severely affected Zora's life.
zh_cn: 她母亲的去逝对她的生活产生了严重的影响。

source: She was rejected by her father and his second wife. Zora was forced to take care of herself.
zh_cn: 她父亲和继母不养她，卓拉被迫自己照顾自己。

source: She left Eatonville and moved north when she was fourteen years old.
zh_cn: 十四岁时，她离开了伊顿威尔镇，向北寻求新生活。

source: She worked for a traveling theater company. She also worked as a maid, cleaning the homes of white people.
zh_cn: 她为一家流动剧院公司工作，她还在白人家当过仆人和清洗工。

source: One of her employers recognized Zora's abilities. She made it possible for her to attend high school in Baltimore, Maryland.
zh_cn: 她的一名雇主发现了她的潜能，她设法让卓拉到马里兰州的巴尔的摩上高中。

source: Zora was twenty-six years old when she began high school. But she said she was only sixteen.
zh_cn: 当卓拉上高中时，她已经二十六岁了，但她说她只有十六岁。

source: Throughout her life, she often said she was younger than she really was.
zh_cn: 在她的一生中，她经常对别人说的年龄要比她实际年龄小得多。

source: In nineteen eighteen, Zora Neale Hurston attended Howard University in Washington, D.C. She studied with Alain Locke. He was a professor of philosophy and an expert on black culture.
zh_cn: 在1918年，卓拉 尼尔 赫斯特上了霍华德大学(该校位于华盛顿特区)，她受教于阿莱 洛克(Alain Locke)，他是哲学教授和黑人文化专家。

source: She earned money by working as a maid and doing other work.
zh_cn: 她通过当仆人和做其他工作而赚钱养活自己。

source: Hurston published her first short stories at Howard University.
zh_cn: 赫斯特在霍华德大学发表了她的第一部短篇小说集。

source: Her stories were about black folklore and life in Eatonville.
zh_cn: 她的这些短篇小说反映了黑人的民间传说和她在伊顿威尔镇的生活。

source: She won prizes for her writings that were published in newspapers and magazines.
zh_cn: 她发表在报纸和杂志上的文章获得了奖。

source: The early nineteen twenties marked the beginning of Zora Neale Hurston's life as a writer.
zh_cn: 在二十世纪二十年代初，标志着她开始了一位作家的生涯。

source: In nineteen twenty-five, Hurston traveled to New York City. This was during the period known as the Harlem Renaissance. Harlem is a famous area in New York.
zh_cn: 在1925年，赫斯特来到了纽约市，此时正是有名的哈莱姆文艺复兴时期，哈莱姆是纽约市一个著名的黑人居住区。

source: The Harlem Renaissance was a period in which black artists explored their culture and showed pride in their race. This was expressed in literature, music and other art forms.
zh_cn: 哈莱姆文艺复兴时期是指黑人艺术家探求他们自身文化和自豪地向人们展示他们种族的时期，这次黑人文艺复兴包括文学、音乐和其他艺术形式。

source: Hurston and her stories about Eatonville became important during the Harlem Renaissance.
zh_cn: 赫斯特和她的有关伊顿威尔镇的短篇小说成为哈莱姆文艺复兴时期重要的组成部分。

source: She met other young black writers of the time, such as poet Langston Hughes.
zh_cn: 她遇到了许多年轻的黑人作家，如诗人兰斯顿休斯。

source: Hurston became the first black student to attend Barnard College in New York. She studied with anthropologist Franz Boas.
zh_cn: 赫斯特成为第一个进入纽约市巴纳德学院的黑人学生，她受教于人类学家弗朗茨博厄斯。

source: She became interested in anthropology -- the study of the origin, development and actions of humans.
zh_cn: 她开始对人类学感兴趣，人类学研究人类起源、发展和社会活动。

source: Boas recognized Hurston's storytelling ability and deep interest in the black culture of the South. He urged her to do more research there.
zh_cn: 博厄斯认识到了赫斯特讲故事的能力，以及她对美国南方黑人文化的浓厚兴趣，他劝她对黑人文化进行更多的研究。

source: Hurston received financial support for most of her research from a wealthy woman in New York named Charlotte Osgood Mason.
zh_cn: 赫斯特接受了纽约市一位有钱白人妇女的支助，进行她的研究，这位支助者名叫夏天洛特 奥斯古德 梅森。

source: During the next several years, Hurston traveled in Florida and the Caribbean to collect and write stories about what she saw.
zh_cn: 在此后的几年里，赫斯特到了佛罗里达和加勒比海，收集黑人文化资料，撰写她所看到的故事。

source: She learned about the traditions of the people she met.
zh_cn: 她了解了她所遇到的人们的生活传统。

source: She spoke with men and women, young and old, collecting their stories in their own words.
zh_cn: 她与男女老少进行交谈，以他们特有的语言，收集他们的故事。

source: She wanted to keep the language exactly as they told it.
zh_cn: 她想完整地保留他们对她讲的语言。

source: Many of the stories were like those she had heard as a child.
zh_cn: 许多故事就像她小时候所听到的故事一样。

source: In nineteen thirty-six, Hurston traveled to Jamaica and Haiti with a financial award from the Guggenheim Foundation.
zh_cn: 在1936年，赫斯特得到古根汉姆基金会的一项奖金，借此她来到了牙买加和海地。

source: The Caribbean people accepted her as one of them. They spoke with her freely, even about religious traditions.
zh_cn: 加勒比海的人们将她看成是自己人，他们很随便地与她交谈，甚至谈论宗教传统。

source: In Haiti, she learned a great deal about the voodoo religion.
zh_cn: 在海地，她广泛地了解了伏都教。

source: Hurston published two important collections of stories based on her research. They were "Mules and Men" and "Tell My Horse." Both examined the voodoo religion.
zh_cn: 赫斯特根据她的研究发表了两部重要的短篇小说集，这就是《Mules and Men》(《骡子和人》)和《Tell My Horse》(《告诉我的马》)，这两部短篇小说集都是有关伏都教的。

source: Zora Neale Hurston published her first book, "Jonah's Gourd Vine," in nineteen thirty-four. The story takes place in a small Florida town. It is about two people similar to her parents.
zh_cn: 卓拉尼尔赫斯特于1934年发表了她的第一部长篇小说《Jonah's Gourd Vine》(《乔纳的葫芦蔓》)，故事发生在佛罗里达小镇，讲述的是两个与她父母很相似的人物。

source: Her second book, "Their Eyes Were Watching God," was published three years later.
zh_cn: 她的第二部长篇小说《Their Eyes Were Watching God》(《眼望苍天》)于三年后发表。

source: It is widely considered her most important work.
zh_cn: 人们普遍认为这部小说是她最重要的作品。

source: She wrote the book in seven weeks while she was traveling in Haiti.
zh_cn: 这部小说是她在海地考察期间利用七个星期写作而成的。

source: It is the story of a black woman's search for happiness and her true identity, during twenty-five years and three marriages.
zh_cn: 这部小说讲述的是一位黑人妇女，在二十五年中，先后三次结婚，不懈寻求幸福和她真实身份的历程。

source: In nineteen forty-two, Hurston published a story about her own life, called "Dust Tracks on a Road."
zh_cn: 在1942年，赫斯特发表了她的个人自传《Dust Tracks on a Road》(《道路上的尘迹》)。

source: But the book was widely criticized. Literary experts said it was full of false information.
zh_cn: 但她的这部自传受到广泛的批评，文学家们说，这部自传充满着虚假的东西。

source: Others said it added to the mystery surrounding the writer.
zh_cn: 有些人说，这部自传给这位作家增添神秘的色彩。

source: Hurston's last two novels were the biblical story "Moses, Man of the Mountain" and "Seraph on the Suwanee." This was the only book she wrote about white people.
zh_cn: 赫斯特最后两部小说则是有关圣经的，即《Moses, Man of the Mountain》(《摩西，山之人》)和《Seraph on the Suwanee》(《斯沃尼的六翼天使》)，这是她唯一一部有关白人的小说。

source: Zora Neale Hurston's stories were about the pain-filled and sometimes magical world that surrounded blacks in the South.
zh_cn: 卓拉尼尔赫斯特的小说大都有关美国南方黑人苦难的故事，有时还向人们展示一个不可的思议的世界。

source: The stories tell about faith, love, family, slavery, race and community. They also include humor.
zh_cn: 这些小说讲述了信仰、爱、家庭、奴隶、种族和社会，在小说中还不乏幽默。

source: Hurston was well known for her writing. She also became known for her outspoken opinions, her clothing and the great pride she had in herself and her race.
zh_cn: 赫斯特以其写作而闻名，她还因公开表达她的观点、她的着装和为己自豪、为黑人自豪而闻名。

source: She was married three times. But she found it impossible to settle down. Her husbands usually expected her to give up her writing. But she said that was the one thing she could not do.
zh_cn: 她先后结了三次婚，但她发现她可能不是一个安于现状的人，她的丈夫们经常希望她放弃她的写作，但她说，这是她所做不到的一件事。

source: Hurston received praise for her work by both blacks and whites. But not everyone enjoyed her work.
zh_cn: 赫斯特因其作品而分别获得了黑人和白人的称赞，但并非每个人都喜欢她的小说。

source: Some of the writers of the Harlem Renaissance criticized her for writing about black culture instead of relations between the races.
zh_cn: 哈莱姆文艺复兴时期的一些作家批评她的作品以黑人文化取代了种族关系。

source: Many blacks also rejected Hurston's political ideas and her support for racial separation laws in the South.
zh_cn: 许多黑人对赫斯特的政治观点和她支持南方种州隔离法律表示反对。

source: Hurston, however, made no apologies for her work. She said the richness of black culture existed to be enjoyed, celebrated and made into literature.
zh_cn: 然而，赫斯特并没有为她的作品而道歉，她说，丰富的黑人文化应该受到人们的欣赏和赞美，并要将黑人文化反映到文学作品中。

source: During the late nineteen forties, she began to publish less and less. She was arrested and charged with sexual wrongdoing with a ten-year-old boy. The charges were later dropped, but the event affected her work and her life.
zh_cn: 在二十世纪四十年代，她发表的文章越来越小，她还因被指控与一个十岁男孩有不正当的性关系而被捕，这个指控后来撤销了，但这件事对她的作品和她的生活产生了很大的影响。

source: In nineteen fifty, Hurston returned to Florida.
zh_cn: 在1950年，赫斯特返回佛罗里达。

source: Although her work was quite popular, she was unable to make a living with her writing.
zh_cn: 尽管她的作品仍然很爱欢迎，但她却不能靠她的写作维持生活。

source: In her later years, she worked as a teacher, a librarian and as maid.
zh_cn: 在她晚年，她当过教师、图书管理员，甚至还做过仆人。

source: In nineteen fifty-nine, Hurston suffered a stroke and entered a nursing home in Fort Pierce, Florida. She died there a year later and was buried in an unmarked grave.
zh_cn: 在1959年，赫斯特遭受到一次打击，随后进入了佛罗里达州的皮尔斯堡疗养院，一年后她在此去逝，她的墓地没有任何标志。

source: Today, Zora Neale Hurston has not been forgotten. She influenced other African-American female writers, including Alice Walker.
zh_cn: 如今，卓拉尼尔赫斯特并没有被人忘记，她影响了其他非裔女作家，这就包括艾丽丝 沃克。

source: Because of Walker's efforts, Hurston's work was rediscovered in the nineteen seventies.
zh_cn: 正是由于沃克的努力，赫斯特的作品在二十世纪七十年代再次被人们所发现。

source: During the nineteen nineties, her book "Their Eyes Were Watching God" sold more than one million copies. Many young people in American schools are reading the book.
zh_cn: 在二十世纪九十年代，她的长篇小说《眼望苍天》销售量高达一百多万册，美国许多学校的学生正在读这部小说。

source: In addition, two of Hurston's plays have been produced.
zh_cn: 另外，赫斯特的两部戏剧也被搬上了舞台。

source: New books have been written about her. And her work and life are the subject of many studies, conferences and festivals.
zh_cn: 许多有关她的新书出版了，而且她的作品和她的一生也成为许多研究、会议和节日的主题。

source: In nineteen seventy-three, Alice Walker placed a marker in Fort Pierce, Florida, where Hurston is believed to be buried. The stone reads, "Zora Neale Hurston, A Genius of the South."
zh_cn: 在1973年，艾丽丝沃克在佛罗里达州皮尔斯堡树立了一块墓碑，据悉，这里正是赫斯特的葬身之地，墓碑上写到：“卓拉 尼尔 赫斯特，美国南方的天才。”
